# Taps
tap "oven-sh/bun"

# CLI Tools & Utilities
brew "jpeg-turbo"          # JPEG image codec with accelerated baseline compression
brew "bat"                  # Modern replacement for 'cat' with syntax highlighting
brew "bottom"               # System monitor (like htop but better)
brew "btop"                 # Resource monitor with graphs
brew "chezmoi"              # Dotfiles manager
brew "curl"                 # Transfer data from/to servers
brew "gd"                   # Graphics library for image creation
brew "libpq", link: true   # PostgreSQL client library
brew "sqlite"               # Self-contained SQL database engine
brew "composer"             # PHP dependency manager
brew "coreutils"            # GNU core utilities (gls, gcp, etc.)
brew "docker-completion"    # Docker shell completion
brew "docker"               # Container platform CLI
brew "docker-compose"       # Multi-container Docker applications
brew "dust"                 # Modern replacement for 'du' - disk usage
brew "duti"                 # Set default applications for document types
brew "elixir"               # Dynamic, functional programming language
brew "eza"                  # Modern replacement for 'ls' with icons
brew "fd"                   # Fast alternative to 'find'
brew "fish"                 # User-friendly command line shell
brew "flyctl"               # Fly.io platform CLI
brew "fzf"                  # Fuzzy finder for command line
brew "gh"                   # GitHub CLI
brew "git"                  # Version control system
brew "git-delta"            # Better git diff viewer
brew "python@3.13"          # Python programming language v3.13
brew "glances"              # Cross-platform system monitoring tool
brew "htop"                 # Interactive process viewer
brew "httpie"               # User-friendly HTTP client
brew "jq"                   # JSON processor
brew "lazygit"              # Terminal UI for git
brew "mysql"                # MySQL database client
brew "neovim"               # Modern Vim fork with better defaults
brew "nvm"                  # Node Version Manager
brew "pocketbase"           # Open source backend in a single file
brew "procs"                # Modern replacement for 'ps'
brew "pyenv"                # Python version management
brew "python@3.12"          # Python programming language v3.12
brew "python@3.9"           # Python programming language v3.9
brew "ripgrep"              # Fast text search tool (rg command)
brew "ruby"                 # Ruby programming language
brew "ruby-install"         # Install Ruby versions
brew "sd"                   # Intuitive find & replace CLI
brew "stow"                 # Symlink farm manager for dotfiles
brew "tealdeer"             # Fast tldr client for command examples
brew "tmux"                 # Terminal multiplexer
brew "tokei"                # Count code lines and statistics
brew "turso"                # SQLite for production (Turso CLI)
brew "watchman"             # File watching service
brew "zenith"               # System monitor with historical data
brew "zoxide"               # Smarter cd command with directory jumping
brew "zsh"                  # Z shell
brew "oven-sh/bun/bun"     # Fast JavaScript runtime & toolkit

# macOS Applications
cask "aldente"              # Battery charge limiter for MacBooks
cask "alt-tab"              # Windows-style alt-tab window switcher
cask "appflowy"             # Open source Notion alternative
cask "arc"                  # Modern web browser with spaces
cask "discord"              # Voice and text chat platform
cask "docker-desktop"       # Docker GUI and container management
cask "firefox@developer-edition"  # Firefox browser for developers
cask "flutter"              # Google's UI toolkit for mobile/web/desktop

# Fonts for Terminal
cask "font-anonymice-powerline"       # Anonymice font with Powerline symbols
cask "font-fira-code"                  # Monospaced font with ligatures
cask "font-fira-mono-for-powerline"   # Fira Mono with Powerline symbols
cask "font-hack-nerd-font"            # Hack font with Nerd Font icons
cask "font-meslo-lg-nerd-font"        # Meslo LG with Nerd Font icons
cask "font-meslo-for-powerlevel10k"   # Meslo font optimized for Powerlevel10k
cask "font-monaspace"                  # GitHub's new font family
cask "font-monaspice-nerd-font"       # Monaspace with Nerd Font icons

# Browsers
cask "google-chrome"        # Google Chrome browser
cask "google-chrome@canary" # Chrome Canary (experimental features)
cask "opera"                # Opera browser
cask "vivaldi"              # Customizable Chromium-based browser

# Development Tools
cask "herd"                 # Laravel and PHP development environment
cask "iterm2"               # Advanced terminal emulator
cask "jetbrains-toolbox"    # JetBrains IDEs manager
cask "postman"              # API development and testing
cask "sourcetree"           # Git GUI client
cask "tableplus"            # Database management GUI
cask "visual-studio-code"   # Microsoft's code editor
cask "warp"                 # Modern terminal with AI features
cask "wave"                 # Terminal for seamless remote development
cask "windsurf"             # AI-powered code editor
cask "wombat"               # Cross-platform gRPC client
cask "zed"                  # High-performance code editor
cask "zen"                  # Privacy-focused browser

# Media & Communication
cask "iina"                 # Modern media player for macOS
cask "skype"                # Video calling and messaging
cask "transmission"         # BitTorrent client
cask "vlc"                  # Versatile media player
cask "whatsapp"             # WhatsApp desktop client

# Productivity & Utilities
cask "jiggler"              # Prevents sleep/screensaver
cask "keyboardcleantool"    # Disables keyboard for cleaning
cask "lastpass"             # Password manager
cask "logi-options+"        # Logitech device configuration (new)
cask "logitech-options"     # Logitech device configuration (legacy)
cask "macs-fan-control"     # Control Mac fan speeds
cask "notion"               # All-in-one workspace
cask "rustdesk"             # Remote desktop software
cask "teamviewer"           # Remote desktop access

# VS Code Extensions
vscode "eamodio.gitlens"                      # Git supercharged
vscode "ms-azuretools.vscode-containers"      # Docker container tools
vscode "ms-vscode-remote.remote-containers"   # Develop in containers