# Taps
tap "aws/tap" # AWS tools
tap "oven-sh/bun" # Bun JavaScript runtime

# Command Line Tools & Development
brew "bat" # Cat clone with syntax highlighting
brew "bottom" # Yet another cross-platform graphical process/system monitor
brew "btop" # Resource monitor that shows usage and stats
brew "chezmoi" # Manage your dotfiles across multiple machines

# Elixir Development
brew "asdf" # Extendable version manager for multiple languages
brew "autoconf" # Automatic configure script builder (Erlang dependency)
brew "wxwidgets" # Cross-platform GUI toolkit (Erlang dependency)
brew "libxslt" # XSLT library (Erlang dependency)
brew "fop" # XSL-FO print formatter (Erlang dependency)
brew "unixodbc" # ODBC 3 connectivity for UNIX (Erlang dependency)

# Ruby Development
brew "rbenv" # Ruby version management
brew "ruby-build" # Install various Ruby versions and implementations
brew "openssl@3" # Cryptography and SSL/TLS toolkit
brew "readline" # Library for command-line editing
brew "libyaml" # YAML 1.1 parser and emitter
brew "gmp" # GNU multiple precision arithmetic library (Ruby dependency)

brew "ruby" # Ruby programming language (fallback system Ruby)
brew "cocoapods" # Dependency manager for Swift and Objective-C
brew "composer" # Dependency manager for PHP
brew "coreutils" # GNU core utilities (adds gdate, gls, etc.)
brew "couchdb", restart_service: :changed # Document-oriented NoSQL database
brew "docker-completion" # Docker bash completion
brew "docker" # Docker bash completion
brew "docker-compose" # Define and run multi-container applications
brew "dust" # More intuitive version of du written in Rust
brew "duti" # Set default applications for document types on macOS
brew "eza" # Modern replacement for ls
brew "fd" # Simple, fast alternative to find
brew "fish" # User-friendly command line shell
brew "nushell" # Modern shell written in Rust with structured data pipelines
brew "flyctl" # Command line tools for Fly.io
brew "fzf" # Command-line fuzzy finder
brew "gh" # Cat clone with syntax highlighting
brew "git" # Distributed version control system
brew "git-delta" # Syntax-highlighting pager for git and diff output
brew "git-filter-repo" # Quickly rewrite git repository history
brew "glances" # Cross-platform system monitoring tool
brew "grpc" # Next generation RPC framework
brew "htop" # Improved top (interactive process viewer)
brew "httpie" # User-friendly cURL replacement
brew "jq" # Lightweight and flexible command-line JSON processor
brew "lazygit" # Simple terminal UI for git commands
brew "mysql" # Open source relational database
brew "neovim" # Hyperextensible Vim-based text editor
brew "node" # Node.js JavaScript runtime
brew "yarn" # JavaScript package manager
brew "nvm" # Node Version Manager
brew "nvtop" # GPU process monitoring for NVIDIA GPUs
brew "pocketbase" # Open source backend in a single file
brew "procs" # Modern replacement for ps written in Rust
brew "pyenv" # Python version management
brew "python@3.12" # Python programming language v3.12
brew "ripgrep" # Recursively search directories for a regex pattern
brew "sd" # Intuitive find & replace CLI (sed alternative)
brew "stow" # Symlink farm manager
brew "tealdeer" # Fast tldr client written in Rust
brew "tmux" # Terminal multiplexer
brew "zellij" # Modern terminal workspace with layouts and plugins
brew "tokei" # Count code, quickly
brew "turso" # Edge SQLite database CLI
brew "watchman" # Watch files and record when they change
brew "zenith" # Sort of like top or htop but with zoom-able charts
brew "zoxide" # Smarter cd command, inspired by z and autojump
brew "starship" # Cross-shell prompt customization
brew "carapace" # Multi-shell completion framework
brew "atuin" # Magical shell history
brew "zsh" # UNIX shell (command interpreter)
brew "oven-sh/bun/bun" # Fast all-in-one JavaScript runtime

# AI Development Tools
# Note: These require API keys to be set in your environment
# See docs/ai-tools/AI.md for setup instructions
cask "claude-code" # Claude Code - AI pair programming by Anthropic
brew "gemini-cli" # Google Gemini CLI
cask "codex" # OpenAI Codex application

# macOS Applications
cask "aldente" # macOS battery charge limiter
cask "alt-tab" # Windows alt-tab on macOS
cask "appflowy" # Open-source alternative to Notion
cask "arc" # Recursively search directories for a regex pattern
cask "discord" # Voice and text chat for communities
cask "docker-desktop" # Application for building and sharing containerized applications
cask "dotnet-runtime" # Microsoft .NET runtime
cask "firefox@developer-edition" # Web browser for developers
cask "flutter" # UI toolkit for building natively compiled applications

# Fonts
cask "font-anonymice-powerline" # Anonymous Pro font patched for Powerline
cask "font-fira-code" # Monospaced font with programming ligatures
cask "font-fira-code-nerd-font" # Fira Code font patched with Nerd Font icons
cask "font-fira-mono-for-powerline" # Fira Mono font for Powerline
cask "font-hack-nerd-font" # Hack font patched with Nerd Font icons
cask "font-meslo-for-powerlevel10k" # Meslo font recommended for Powerlevel10k
cask "font-meslo-lg-nerd-font" # Meslo LG font patched with Nerd Font icons
cask "font-monaspace" # GitHub's innovative font family
cask "font-monaspice-nerd-font" # Monaspace font patched with Nerd Font icons
cask "font-jetbrains-mono" # JetBrains Mono - Developer font with ligatures
cask "font-jetbrains-mono-nerd-font" # JetBrains Mono patched with Nerd Font icons

# macOS Applications
cask "google-chrome" # Web browser
cask "google-chrome@canary" # Experimental version of Chrome
cask "herd" # Laravel and PHP development environment
cask "iina" # Modern media player for macOS
cask "iterm2" # Terminal emulator for macOS
cask "jetbrains-toolbox" # JetBrains IDE manager
cask "jiggler" # Prevents sleep by jiggling the mouse
cask "keyboardcleantool" # Temporarily disable keyboard for cleaning
cask "lastpass" # Password manager
cask "logi-options+" # Software for Logitech devices (new version)
cask "macs-fan-control" # Control fans on Apple computers
cask "notion" # All-in-one workspace for notes and collaboration
cask "opera" # Web browser with built-in VPN
cask "postman" # API development and testing platform
cask "rustdesk" # Remote desktop software
cask "skype" # Video chat and messaging
cask "sourcetree" # Git GUI client
cask "tableplus" # Modern, native database management tool
cask "teamviewer" # Remote control and remote support
cask "transmission" # BitTorrent client
cask "visual-studio-code" # Open-source code editor
cask "vivaldi" # Feature-rich web browser
cask "vlc" # Multimedia player
cask "ghostty" # Fast, feature-rich terminal emulator
cask "warp" # Modern, Rust-based terminal
cask "wezterm" # GPU-accelerated cross-platform terminal emulator
cask "wave" # AI-powered terminal
cask "whatsapp" # Messaging app
cask "windsurf" # AI-powered code editor
cask "wombat" # Cross-platform file manager
cask "zed" # Application for building and sharing containerized applications
cask "zen" # Sort of like top or htop but with zoom-able charts

# VS Code Extensions
vscode "anthropic.claude-code" # Claude AI assistant for VS Code
vscode "eamodio.gitlens" # Supercharge Git within VS Code
vscode "laravel.vscode-laravel" # Laravel support for VS Code
vscode "ms-azuretools.vscode-containers" # Work with Docker containers
vscode "ms-vscode-remote.remote-containers" # Open folders in containers
vscode "openai.chatgpt" # ChatGPT integration for VS Code
