tap "oven-sh/bun"
brew "jpeg-turbo"
brew "bat"
brew "bottom"
brew "btop"
brew "chezmoi"
brew "curl"
brew "gd"
brew "libpq", link: true
brew "sqlite"
brew "composer"
brew "coreutils"
brew "docker-completion"
brew "docker"
brew "docker-compose"
brew "dust"
brew "duti"
brew "elixir"
brew "eza"
brew "fd"
brew "fish"
brew "flyctl"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "python@3.13"
brew "glances"
brew "htop"
brew "httpie"
brew "jq"
brew "lazygit"
brew "mysql"
brew "neovim"
brew "nvm"
brew "pocketbase"
brew "procs"
brew "pyenv"
brew "python@3.12"
brew "python@3.9"
brew "ripgrep"
brew "ruby"
brew "ruby-install"
brew "sd"
brew "stow"
brew "tealdeer"
brew "tmux"
brew "tokei"
brew "turso"
brew "watchman"
brew "zenith"
brew "zoxide"
brew "zsh"
brew "oven-sh/bun/bun"
cask "aldente"
cask "alt-tab"
cask "appflowy"
cask "arc"
cask "discord"
cask "docker-desktop"
cask "firefox@developer-edition"
cask "flutter"
cask "font-anonymice-powerline"
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-meslo-for-powerlevel10k"
cask "font-monaspace"
cask "font-monaspice-nerd-font"
cask "google-chrome"
cask "google-chrome@canary"
cask "herd"
cask "iina"
cask "iterm2"
cask "jetbrains-toolbox"
cask "jiggler"
cask "keyboardcleantool"
cask "lastpass"
cask "logi-options+"
cask "logitech-options"
cask "macs-fan-control"
cask "notion"
cask "opera"
cask "postman"
cask "rustdesk"
cask "skype"
cask "sourcetree"
cask "tableplus"
cask "teamviewer"
cask "transmission"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "warp"
cask "wave"
cask "whatsapp"
cask "windsurf"
cask "wombat"
cask "zed"
cask "zen"
vscode "eamodio.gitlens"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
